#### DuctPressureDropData Class

---

|  |
| --- |
| Members   See Also |

The input and output data used by external servers for calculation of the duct pressure drop.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class DuctPressureDropData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class DuctPressureDropData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class DuctPressureDropData : IDisposable ``` |

# Remarks

Profile type, Height, Diameter for round profile or width for other profiles, Length, Density, Viscosity, Roughness and Flow are input field values for the calculation. EquivalentDiameter, HydraulicDiameter, ReynoldsNumber, Velocity, VelocityPressure, Friction, PressureDrop, and Coefficient are output field values for the calculation

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Mechanical DuctPressureDropData

# See Also

DuctPressureDropData Members

Autodesk.Revit.DB.Mechanical Namespace